<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<!--
$Revision$
-->
  <title>ELOG Electronic Logbook Help</title>
</head>
  <body>
  
<table border="0" width="100%" bgcolor="#486090" cellpadding="1"
 cellspacing="0" align="center">
  <tbody>
    <tr>
      <td>
      <table cellpadding="5" cellspacing="0" border="0" width="100%"
 bgcolor="#486090">
  <tbody>
          <tr>
            <td align="center" bgcolor="#486090"> <font
 face="verdana,arial,helvetica,sans-serif" size="5" color="#ffffff">Ajuda
do ELOG Electronic Logbook<br>
            </font></td>
          </tr>
  <tr>
            <td bgcolor="#ffffff"><br>
The Electronic Logbook (<i>ELog</i>) pode ser usado para armazenar e recuperar
mensagens atrav&eacute;s de uma interface Web. Dependendo da configura&ccedil;&atilde;o,
o sistema ELog pode administrar um ou mais <i>logbooks</i>, que s&atilde;o
armazenados em se&ccedil;&otilde;es separadas no servidor.
            <p></p>
            </td>
          </tr>
  <tr>
            <td bgcolor="#486090"><font color="#ffffff"><b>Resumo r&aacute;pido</b></font></td>
          </tr>
  <tr>
            <td bgcolor="#ffffff"><br>
Por padr&atilde;o, a &uacute;ltima mensagem em um logbook &eacute; exibida.
Pode-se usar os bot&otilde;es de navega&ccedil;&atilde;o para exibir a primeira
mensagem, a mensagem anterior, a pr&oacute;xima, e a &uacute;ltima mensagem.
            <p>  Se um dos checkboxes pr&oacute;ximos a um dos campos de
atributo estiver checado, apenas mensagens referentes &agrave;quele atributo
ser&atilde;o exibidas pelos bot&otilde;es de navega&ccedil;&atilde;o. Isso
pode ser usado como um filtro r&aacute;pido para exibir apenas p&aacute;ginas
de um certo autor ou categoria, por exemplo.</p>
            <p>O bot&atilde;o <b>Novo</b> cria uma nova mensagem. Com o bot&atilde;o
            <b>Editar</b> pode-se editar uma mensagem existente, se isso
for permitido pelo arquivo de configura&ccedil;&atilde;o. O bot&atilde;o
            <b>Responder</b> cria uma resposta para uma mensagem existente,
semelhante &agrave; uma resposta de email.</p>
            <p>  O bot&atilde;o <b>Procurar</b> abre uma p&aacute;gina de
busca, na qual mensagens de um logbook podem ser exibidas com base em regras
de filtragem. Cada campo que n&atilde;o estiver vazio funciona como um filtro
adicional, que &eacute; acrescentado &agrave;s outras regras. Se nenhum filtro
for selecionado, todas as mensagens de um logbook ser&atilde;o exibidas.
Os bot&otilde;es <b>&Uacute;ltimo dia</b> e <b>&Uacute;ltimas 10</b> exibem
todas as mensagens das &uacute;ltimas 24 horas e as dez &uacute;ltimas mensangens,
respectivamente.</p>
            <p>  </p>
            </td>
          </tr>
  <tr>
            <td bgcolor="#486090"><font color="#fffff0"><b>Maiores informa&ccedil;&otilde;es</b></font></td>
          </tr>
  <tr>
            <td bgcolor="#ffffff"><br>
Para maiores informa&ccedil;&otilde;es, especialmente quanto &agrave; configura&ccedil;&atilde;o
do ELog, consulte a <a href="http://midas.psi.ch/elog">P&aacute;gina do ELOG</a>
.
            <p>  </p>
            </td>
          </tr>
        </tbody>
      </table>
      </td>
    </tr>
  </tbody>
</table>
  
<hr> 
<address> <a href="http://midas.psi.ch/%7Estefan">S. Ritt</a>, 28 August
2001<br>
Traduzido para o portugu&ecirc;s do Brasil por <a href="mailto:caugm@ig.com.br">Carlos
Augusto Marcicano</a>, abril de 2002.<br>
 </address>
  
</body>
</html>
