<!--
$Revision$
-->

<html><head>
<title>Aide sur la main-courante &eacute;lectronique ELOG</title>
</head>

<body>

<table border=0 width=100%% bgcolor=#486090 cellpadding=1 cellspacing=0 align=center>

<tr><td><table cellpadding=5 cellspacing=0 border=0 width=100%% bgcolor=#486090>

<tr><td align=center bgcolor=#486090>
<font face=verdana,arial,helvetica,sans-serif size=5 color=#FFFFFF>
Aide sur la main-courante &eacute;lectronique ELOG<br></font></td></tr>

<tr><td bgcolor=#FFFFFF><br>La "<b>main-courante &eacute;lectronique</b>" (<i>ELog</i>) peut &ecirc;tre utilis&eacute;e pour
cr&eacute;er des messages et y acc&eacute;der &agrave; travers une interface Web. Suivant le param&eacute;trage, un serveur ELog
peut h&eacute;berger un ou plusieurs "<b>registres</b>" (</i>logbooks</i>) qui sont enregistr&eacute;s s&eacute;par&eacute;ment.
<p>

</td></tr>

<tr><td bgcolor=#486090><font color=#FFFFFF><b>Aper&ccedil;u rapide</b></font></td></tr>

<tr><td bgcolor=#FFFFFF><br>
Par d&eacute;faut, la derni&egrave;re entr&eacute;e en date est affich&eacute;e. On peut utiliser les boutons de navigation
pour afficher l'entr&eacute;e pr&eacute;c&eacute;dente ou suivante, ou aller directement &agrave; la premi&egrave;re ou &agrave; la derni&egrave;re.
<p>
Si l'une des cases &agrave; c&ocirc;t&eacute; des intitul&eacute;s de champs est coch&eacute;e, seuls les messages ayant la m&ecirc;me
valeur pour cet attribut seront affich&eacute;s par les boutons de navigation : ceci peut &ecirc;tre utilis&eacute;
comme un filtre rapide, pour parcourir toutes les entr&eacute;es d'un m&ecirc;me auteur ou d'une
cat&eacute;gorie donn&eacute;e.
<p>
La commande <b>Cr&eacute;er</b> permet d'ajouter une nouvelle entr&eacute;e. La commande <b>Modifier</b>,
si le param&eacute;trage l'autorise, permet l'&eacute;dition d'une entr&eacute;e existante. La commande <b>R&eacute;pondre</b>
cr&eacute;e une entr&eacute;e en r&eacute;f&eacute;rence &agrave; une entr&eacute;e existante, comme lorsqu'on r&eacute;pond &agrave; un m&eacute;l.
<p>
La commande <b>Chercher</b> affiche un formulaire de recherche, qui permet de filtrer
les entr&eacute;es suivant divers crit&egrave;res. Chaque crit&egrave;re non-vide ajoute un filtre, et les filtres
sont cumul&eacute;s ("ET" logique). Si aucun crit&egrave;re n'est renseign&eacute;, toutes les entr&eacute;es du journal
sont affich&eacute;es.
<p>
Les commandes <b>Dernier jour</b> et <b>10 Derni&egrave;res entr&eacute;es</b> agissent comme des
recherches simplifi&eacute;es, affichant respectivement les entr&eacute;es des derni&egrave;res 24 heures, et les 10 derni&egrave;res
entr&eacute;es cr&eacute;&eacute;es.
<p>

</td></tr>

<tr><td bgcolor=#486090><font color=#FFFFF><b>Plus d'informations</b></font></td></tr>

<tr><td bgcolor=#FFFFFF><br>Pour plus de pr&eacute;cisions, notamment sur le param&eacute;trage d'un serveur ELog, r&eacute;f&eacute;rez-vous
&agrave; la <A HREF="http://midas.psi.ch/elog">page d'accueil ELOG</A> (en anglais).<P>

</td></tr></table></td></tr></table>

<hr>
<address>
<a href="http://midas.psi.ch/~stefan">S. Ritt</a>, 28 August 2001
<br>Traduit en fran&ccedil;ais par <a href="mailto:fredp@multimania.com">Fred Pacquier</a>, d&eacute;cembre 2001
</address>

</body></html>
